books_app/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" LIMIT ? OFFSET ?  [["LIMIT", 11], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"
---
  def index
    @books = Book.page(params[:page]).per(SHOW_PER_PAGE)

INSERT INTO "books" ("title", "memo", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["memo", ""], ["created_at", "2019-03-27 04:54:55.180964"], ["updated_at", "2019-03-27 04:54:55.180964"], ["author", ""]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = ?, "memo" = ?, "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "テスト漫画"], ["memo", "テスト漫画のメモ書きです"], ["author", "テスト漫画の著者です"], ["updated_at", "2019-03-27 07:23:14.189846"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
---
  def destroy
    @book.destroy